#include "TextDB.h"

TextDB::TextDB()
{
	allText["head"] = "LOST CITY";

	allText["start"] = 
		"Больше 10 лет прошлло с тех пор как с территории империи пропал крупный приграничный город. "
		"Пропали все жители, животные, здания, пригородные деревни, часть дороги и целое войско."
		"Остался только пустырь, трава и чистое поле. Разведчики год пытались найти хоть какие то следы."
		"В конце концов во всём обвинили несколльких картографов, которые так же быстро исчезли в казематах императора."
		"Разговоры о магическом исчезновении города быстро и жестоко присекались. И название пропавшего города быстро исчезло из "
		"официальных источников империи. Но слухи остались, продолжая нагонять жути на непослушных детей и впечатлительных крестьян."
		"А неделю назад город появился вновь, точно там где он был на старых картах. Разведчики нашедшие город наотрез отказались "
		"приближаться к городу, названия которого никто уже и не помнил. Поэтому выбор пал на тебя. Кто же ты?"
	;
	
}

TextDB::~TextDB()
{
	
}
